adapterservices/riv.sll.clinicalprocess.healthcond.description/takecare-clinicalprocess-healthcond-description-adapter/takecare-clinicalprocess-healthcond-description-adapter-service/src/test/resources/testfiles/importRaRegistryData/request-input-expected-result.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:itr="urn:riv:itintegration:registry:1" xmlns:tns="urn:riv:sll:clinicalprocess:healthcond:description:RegisterRaDSDataResponder:1" xmlns:core="urn:riv:sll:clinicalprocess:healthcond:description:1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Header>
    <itr:LogicalAddress>1234567890</itr:LogicalAddress>
  </soapenv:Header>
  <soapenv:Body>
    <tns:RegisterRaDSData>
      <tns:patient>
        <core:personId>
	      <core:id>191212121212</core:id>
	      <core:type>1.2.752.129.2.1.3.1</core:type>
        </core:personId>
        <core:givenName>Tolvan</core:givenName>
        <core:surname>Tolvansson</core:surname>
      </tns:patient>
      <tns:registryData>
        <tns:inclusionCriteria>
          <tns:arthritisInHand>true</tns:arthritisInHand>
          <tns:morningStiffness>true</tns:morningStiffness>
          <tns:rheumaticNoduli>false</tns:rheumaticNoduli>
          <tns:rheumatoidFaktorPos>true</tns:rheumatoidFaktorPos>
          <tns:xrayChanges>false</tns:xrayChanges>
          <tns:symmetricArthritis>true</tns:symmetricArthritis>
        </tns:inclusionCriteria>
        <tns:responsiblePhysician>
          <tns:ID>191212121212</tns:ID>
          <tns:givenName>Sven</tns:givenName>
          <tns:surname>Larsson</tns:surname>
          <tns:HSAID>HSAID0</tns:HSAID>
          <tns:profession>profession0</tns:profession>
        </tns:responsiblePhysician>
        <tns:hospital>
          <tns:provider>provider0</tns:provider>
          <tns:unit>unit0</tns:unit>
          <tns:HSAID>HSAID1</tns:HSAID>
        </tns:hospital>
        <tns:diagnosis>
          <tns:diagnose>
            <tns:name>name0</tns:name>
            <tns:onsetDate>20060504</tns:onsetDate>
          </tns:diagnose>
          <tns:diagnose>
            <tns:name>name1</tns:name>
            <tns:onsetDate>20060504</tns:onsetDate>
          </tns:diagnose>
        </tns:diagnosis>
        <tns:dominantHand>dominantHand0</tns:dominantHand>
        <tns:weight>0</tns:weight>
        <tns:height>0</tns:height>
        <tns:menopaus>false</tns:menopaus>
        <tns:menopausAge>0</tns:menopausAge>
        <tns:studyProjects>
          <tns:studyProject>Ny koppling</tns:studyProject>
          <tns:studyProject>Ny studie</tns:studyProject>
        </tns:studyProjects>
        <tns:visitDate>20110114</tns:visitDate>
        <tns:visitDoctor>
          <tns:ID>191111111111</tns:ID>
          <tns:givenName>Thomas</tns:givenName>
          <tns:surname>Jansson</tns:surname>
          <tns:HSAID>HSAID2</tns:HSAID>
          <tns:profession>profession1</tns:profession>
        </tns:visitDoctor>
        <tns:CRP>0</tns:CRP>
        <tns:HAQ>2.5</tns:HAQ>
        <tns:globalHealth>0</tns:globalHealth>
        <tns:tenderJoints>0</tns:tenderJoints>
        <tns:swollenJoints>10</tns:swollenJoints>
        <tns:DAS>0</tns:DAS>
        <tns:doctorsGlobal>0</tns:doctorsGlobal>
        <tns:thrombocytes>0</tns:thrombocytes>
        <tns:RF>RF0</tns:RF>
        <tns:antiCcp>0</tns:antiCcp>
        <tns:xrayDate>20060504</tns:xrayDate>
        <tns:erosion>0</tns:erosion>
        <tns:progress>0</tns:progress>
        <tns:drugs>
          <tns:drug>
            <tns:name>BioXtreme</tns:name>
            <tns:startDate>20100111</tns:startDate>
            <tns:type>Biological</tns:type>
            <tns:interval>3</tns:interval>
          </tns:drug>
          <tns:drug>
            <tns:name>Betapred</tns:name>
            <tns:dose>500</tns:dose>
            <tns:startDate>20100101</tns:startDate>
            <tns:endDate>20121231</tns:endDate>
            <tns:endCause>endCause1</tns:endCause>
            <tns:type>DMARD</tns:type>
            <tns:interval>3</tns:interval>
          </tns:drug>
          <tns:drug>
            <tns:name>Trial</tns:name>
            <tns:startDate>20100101</tns:startDate>
            <tns:type>DMARD</tns:type>
            <tns:interval>3</tns:interval>
          </tns:drug>
        </tns:drugs>
        <tns:smoking>false</tns:smoking>
        <tns:tenderJoints68>0</tns:tenderJoints68>
        <tns:swollenJoints66>0</tns:swollenJoints66>
        <tns:basdaiScore>0</tns:basdaiScore>
        <tns:basfiScore>0</tns:basfiScore>
      </tns:registryData>
    </tns:RegisterRaDSData>
  </soapenv:Body>
</soapenv:Envelope>
